/*

  ZPL - Global module
  
Usage:
  #define ZPL_IMPLEMENTATION exactly in ONE source file right BEFORE including the library, like:
  
  #define ZPL_IMPLEMENTATION
  #include "zpl.h"
  
  To make use of platform layer, define ZPL_PLATFORM, like:
  
  #define ZPL_PLATFORM
  #include "zpl.h"
  
Options:

  ZPL_PREFIX_TYPES - to make sure all ZPL defined types have a prefix to avoid cluttering the global namespace.
  ZPL_DEFINE_NULL_MACRO - to let ZPL define what NULL stands for in case it is undefined.
  
  
Credits:
  Read AUTHORS.md
  
GitHub:
  https://github.com/zpl-c/zpl
  
Version History:
9.0.3 - Small fixes and removals
9.0.0 - New documentation format, removed deprecated code, changed styles

8.14.1 - Fix string library
8.14.0 - Added zpl_re_match_all
8.13.0 - Update system command API
  8.12.6 - Fix warning in CLI options parser
8.12.5 - Support parametric options preceding positionals
  8.12.4 - Fixed opts positionals ordering
  8.12.3 - Fixed incorrect handling of flags preceding positionals
  8.12.2 - JSON parsing remark added
  8.12.1 - Fixed a lot of important stuff
  8.12.0 - Added helper constructors for containers
  8.11.2 - Fix bug in opts module
  8.11.1 - Small code improvements
  8.11.0 - Ported regex processor from https://github.com/gingerBill/gb/ and applied fixes on top of it 
  8.10.2 - Fix zpl_strtok
  8.10.1 - Replace zpl_strchr by zpl_char_last_occurence
  8.10.0 - Added zpl_strchr
  8.9.0  - API improvements for JSON5 parser

#define ZPL_WINMAIN( )                                                                                                 \
int CALLBACK WinMain(_In_ HINSTANCE hInstance, _In_ HINSTANCE hPrevInstance, _In_ LPSTR lpCmdLine,                 \
_In_ int nCmdShow)

#if !defined(ZPL_NO_WINDOWS_H)
#define NOMINMAX 1
#define WIN32_LEAN_AND_MEAN 1
#define WIN32_MEAN_AND_LEAN 1
#define VC_EXTRALEAN 1
#include <windows.h>
#undef NOMINMAX
#undef WIN32_LEAN_AND_MEAN
#undef WIN32_MEAN_AND_LEAN
#undef VC_EXTRALEAN
#endif

#include <malloc.h> // NOTE: _aligned_*()

#if !defined(ZPL_NO_SIMD)
#include <intrin.h>
#endif

// TODO(ZaKlaus): Find a better way to get this flag in MinGW.
#if defined(ZPL_COMPILER_GCC) && !defined(WC_ERR_INVALID_CHARS)
#define WC_ERR_INVALID_CHARS 0x0080
#endif

#else

#define ZPL_WINMAIN int main(void)

#if !defined(ZPL_SYSTEM_EMSCRIPTEN)
#include <pthread.h>
#endif

#include <dlfcn.h>
#include <errno.h>
#include <fcntl.h>
#ifndef _IOSC11_SOURCE
#define _IOSC11_SOURCE
#endif
#include <stdlib.h> // NOTE: malloc on linux
#include <sys/mman.h>

#if !defined(ZPL_SYSTEM_OSX)
#include <sys/sendfile.h>
#endif

#include <dirent.h>
#include <sys/stat.h>
#include <sys/time.h>
#include <sys/types.h>
#include <time.h>
#include <string.h>
#include <unistd.h>

#if !defined(ZPL_SYSTEM_ANDROID)
#include <spawn.h>
#endif

#if !defined(ZPL_NO_SIMD)
#if !defined(ZPL_SYSTEM_ANDROID) && !defined(ZPL_SYSTEM_IOS)
#if !defined(ZPL_SYSTEM_EMSCRIPTEN)
#include <emmintrin.h>
#elif defined(ZPL_CPU_X86) && !defined(ZPL_SYSTEM_EMSCRIPTEN)
#include <xmmintrin.h>
#else
#include <sched.h>
#endif
#endif
#endif

#endif

#if defined(ZPL_SYSTEM_OSX)
#include <copyfile.h>
#include <mach/clock.h>
#include <mach/mach.h>
#include <mach/mach_init.h>
#include <mach/mach_time.h>
#include <mach/thread_act.h>
#include <mach/thread_policy.h>
#include <stdio.h>
#include <sys/sysctl.h>
#endif

#if defined(ZPL_SYSTEM_UNIX)
#include <semaphore.h>
#endif

#if !defined(ZPL_SYSTEM_WINDOWS)
#include <stdarg.h>
#include <stddef.h>
#endif

////////////////////////////////////////////////////////////////
//
// Base Types
//
//

#if defined(ZPL_COMPILER_MSVC)
#if _MSC_VER < 1300
typedef unsigned char zpl_u8;
typedef signed char zpl_i8;
typedef unsigned short zpl_u16;
typedef signed short zpl_i16;
typedef unsigned int zpl_u32;
typedef signed int zpl_i32;
#else
typedef unsigned __int8 zpl_u8;
typedef signed __int8 zpl_i8;
typedef unsigned __int16 zpl_u16;
typedef signed __int16 zpl_i16;
typedef unsigned __int32 zpl_u32;
typedef signed __int32 zpl_i32;
#endif
typedef unsigned __int64 zpl_u64;
typedef signed __int64 zpl_i64;
#else
#include <stdint.h>
typedef uint8_t zpl_u8;
typedef int8_t zpl_i8;
typedef uint16_t zpl_u16;
typedef int16_t zpl_i16;
typedef uint32_t zpl_u32;
typedef int32_t zpl_i32;
typedef uint64_t zpl_u64;
typedef int64_t zpl_i64;
#endif

ZPL_STATIC_ASSERT(sizeof(zpl_u8) == sizeof(zpl_i8));
ZPL_STATIC_ASSERT(sizeof(zpl_u16) == sizeof(zpl_i16));
ZPL_STATIC_ASSERT(sizeof(zpl_u32) == sizeof(zpl_i32));
ZPL_STATIC_ASSERT(sizeof(zpl_u64) == sizeof(zpl_i64));

ZPL_STATIC_ASSERT(sizeof(zpl_u8) == 1);
ZPL_STATIC_ASSERT(sizeof(zpl_u16) == 2);
ZPL_STATIC_ASSERT(sizeof(zpl_u32) == 4);
ZPL_STATIC_ASSERT(sizeof(zpl_u64) == 8);

typedef size_t zpl_usize;
typedef ptrdiff_t zpl_isize;

ZPL_STATIC_ASSERT(sizeof(zpl_usize) == sizeof(zpl_isize));

// NOTE: (u)zpl_intptr is only here for semantic reasons really as this library will only support 32/64 bit OSes.
#if defined(_WIN64)
typedef signed __int64 zpl_intptr;
typedef unsigned __int64 zpl_uintptr;
#elif defined(_WIN32)
// NOTE; To mark types changing their size, e.g. zpl_intptr
#ifndef _W64
#if !defined(__midl) && (defined(_X86_) || defined(_M_IX86)) && _MSC_VER >= 1300
#define _W64 __w64
#else
#define _W64
#endif
#endif

typedef _W64 signed int zpl_intptr;
typedef _W64 unsigned int zpl_uintptr;
#else
typedef uintptr_t zpl_uintptr;
typedef intptr_t zpl_intptr;
#endif

ZPL_STATIC_ASSERT(sizeof(zpl_uintptr) == sizeof(zpl_intptr));

typedef float zpl_f32;
typedef double zpl_f64;

ZPL_STATIC_ASSERT(sizeof(zpl_f32) == 4);
ZPL_STATIC_ASSERT(sizeof(zpl_f64) == 8);

typedef zpl_i32 Rune; // NOTE: Unicode codepoint
typedef zpl_i32 char32;
#define ZPL_RUNE_INVALID cast(Rune)(0xfffd)
#define ZPL_RUNE_MAX cast(Rune)(0x0010ffff)
#define ZPL_RUNE_BOM cast(Rune)(0xfeff)
#define ZPL_RUNE_EOF cast(Rune)(-1)

typedef zpl_i8 zpl_b8;
typedef zpl_i16 zpl_b16;
typedef zpl_i32 zpl_b32;

#if !defined(__cplusplus)
#if (defined(_MSC_VER) && _MSC_VER < 1800) || (!defined(_MSC_VER) && !defined(__STDC_VERSION__))
#ifndef true
#define true(0 == 0)
#endif
#ifndef false
#define false(0 != 0)
#endif
typedef zpl_b8 bool;
#else
#include <stdbool.h>
#endif
#endif

#define u8 zpl_u8
#define i8 zpl_i8
#define u16 zpl_u16
#define i16 zpl_i16
#define u32 zpl_u32
#define i32 zpl_i32
#define u64 zpl_u64
#define i64 zpl_i64
#define b8 zpl_b8
#define b16 zpl_b16
#define b32 zpl_b32
#define f32 zpl_f32
#define f64 zpl_f64
#define usize zpl_usize
#define isize zpl_isize
#define uintptr zpl_uintptr
#define intptr zpl_intptr

#ifndef U8_MIN
